In [11]:
import pandas as pd

students=["sachin", "rahul", "sourav", "virat"]

data=pd.Series(students)


data

0    sachin
1     rahul
2    sourav
3     virat
dtype: object

In [21]:
students=[["Student_name","Student_age","student_city"],
          ["sachin", "45", "mumbai"],
          ["rahul", 48, "delhi"],
          ["sourav", 50, "kolkata"],
          ["virat", 30, "bangalore"]]

data=pd.DataFrame(students)
data.to_csv("students_data.csv",index=False,header=False)

In [23]:
stock_data=pd.read_csv("tesla-stock-price.csv")
stock_data.head()

         date   close         volume    open    high       low
0       11:34  270.49      4,787,699  264.50  273.88  262.2400
1  2018/10/15  259.59   6189026.0000  259.06  263.28  254.5367
2  2018/10/12  258.78   7189257.0000  261.00  261.99  252.0100
3  2018/10/11  252.23   8128184.0000  257.53  262.25  249.0300
4  2018/10/10  256.88  12781560.0000  264.61  265.51  247.7700

In [25]:
stock_data.tail(10)

           date   close         volume    open      high     low
747  2015/10/28  212.96   2726880.0000  211.31  213.4500  208.30
748  2015/10/27  210.35   3512832.0000  214.84  217.1000  207.51
749  2015/10/26  215.26   3388227.0000  211.38  215.8800  210.00
750  2015/10/23  209.09   4226411.0000  215.00  215.3500  207.69
751  2015/10/22  211.72   2818801.0000  211.56  215.7500  209.40
752  2015/10/21  210.09   4177956.0000  211.99  214.8100  208.80
753  2015/10/20  213.03  14877020.0000  227.72  228.6000  202.00
754  2015/10/19  228.10   2506836.0000  226.50  231.1500  224.94
755  2015/10/16  227.01   4327574.0000  223.04  230.4805  222.87
756  2015/10/15  221.31   2835920.0000  216.43  221.7300  213.70

In [27]:
stock_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 757 entries, 0 to 756
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    757 non-null    object
 1   close   757 non-null    float64
 2   volume  757 non-null    object
 3   open    757 non-null    float64
 4   high    757 non-null    float64
 5   low     757 non-null    float64
dtypes: float64(4), object(2)
memory usage: 35.6+ KB

In [26]:
stock_data.describe()

            close        open        high         low
count  757.000000  757.000000  757.000000  757.000000
mean   272.645614  272.760659  277.122776  268.017399
std     58.378585   58.449827   59.194761   57.515736
min    143.670000  142.320000  154.970000  141.050000
25%    219.560000  219.640000  222.569000  216.080000
50%    277.450000  277.625000  280.789900  273.550000
75%    322.690000  321.560000  327.120000  316.560100
max    385.000000  386.690000  389.610000  379.345000

In [49]:
mall_data=pd.read_csv("mall_customers.csv")
mall_data.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  201.000000  200.000000          200.000000              200.000000
mean   101.000000   38.850000           60.560000               50.200000
std     58.167861   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     51.000000   28.750000           41.500000               34.750000
50%    101.000000   36.000000           61.500000               50.000000
75%    151.000000   49.000000           78.000000               73.000000
max    201.000000   70.000000          137.000000               99.000000

In [33]:
print(mall_data["Annual Income (k$)"].mean())
print(mall_data["Annual Income (k$)"].max())
print(mall_data["Annual Income (k$)"].min())
print(mall_data["Annual Income (k$)"].std())
print(mall_data["Annual Income (k$)"].var())
print(mall_data["Annual Income (k$)"].mode())
print(mall_data["Annual Income (k$)"].median())

60.56
137
15
26.264721165271244
689.8355778894472
0    54
1    78
Name: Annual Income (k$), dtype: int64
61.5

In [ ]:
#print all customers data where age is greater than 40
mall_data[(mall_data["Annual Income (k$)"]>40) & (mall_data["Age"]>40)]

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
50           51  Female   49                  42                      52
53           54    Male   59                  43                      60
54           55  Female   50                  43                      45
55           56    Male   47                  43                      41
56           57  Female   51                  44                      50
..          ...     ...  ...                 ...                     ...
184         185  Female   41                  99                      39
186         187  Female   54                 101                      24
188         189  Female   41                 103                      17
194         195  Female   47                 120                      16
196         197  Female   45                 126                      28

[63 rows x 5 columns]

In [45]:
mall_data.sort_values(by=["Annual Income (k$)"] , ascending=True)

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [51]:
mall_data.isnull().sum()

CustomerID                0
Gender                    1
Age                       1
Annual Income (k$)        1
Spending Score (1-100)    1
dtype: int64

In [73]:
#fill null value with average value
mall_data[mall_data["Age"] == 0] = mall_data["Age"].mean()
mall_data[mall_data["Annual Income (k$)"] == 0] = mall_data["Annual Income (k$)"].mean()
mall_data[mall_data["Spending Score (1-100)"] == 0] = mall_data["Spending Score (1-100)"].mean()
mall_data.tail(5)

,CustomerID,Gender,Age,Annual Income (k$),Spending Score (1-100)
196,197.000000,Female,45.000000,126.000000,28.000000
197,198.000000,Male,32.000000,126.000000,74.000000
198,199.000000,Male,32.000000,137.000000,18.000000
199,200.000000,Male,30.000000,137.000000,83.000000
200,38.656716,38.656716,38.656716,38.656716,38.656716

In [74]:
mall_data.to_csv("mall_customers_filled.csv", index=False)